Tekla Open API Reference for Tekla Structures 2025
Offset.Dx Property
 The current object's Dx offset. This value is defined using the object's coordinate system.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Dx { get; set; }
Public Property Dx As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Offset Class
Tekla.Structures.Model Namespace